ahtn/keyplus/ports/efm8/efm8/mcu/C8051F990/inc/SI_C8051F990_Defs.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F980_GM
//  C8051F981_GM
//  C8051F982_GM
//  C8051F983_GM
//  C8051F985_GM
//  C8051F986_GM
//  C8051F986_GU
//  C8051F987_GM
//  C8051F987_GU
//  C8051F988_GM
//  C8051F988_GU
//  C8051F989_GM
//  C8051F989_GU
//  C8051F990_GDI
//  C8051F990_GM
//  C8051F991_GDI
//  C8051F991_GM
//  C8051F996_GDI
//  C8051F996_GM
//  C8051F996_GU
//  C8051F997_GDI
//  C8051F997_GM
//  C8051F997_GU

#ifndef SI_C8051F990_DEFS_H
#define SI_C8051F990_DEFS_H

#include <compiler_defs.h>

//-----------------------------------------------------------------------------
// Register Definitions
//-----------------------------------------------------------------------------
SFR (ACC,      0xE0); ///< Accumulator                                      
SFR (ADC0AC,   0xBA); ///< ADC0 Accumulator Configuration                   
SFR (ADC0CF,   0x97); ///< ADC0 Configuration                               
SFR (ADC0CN,   0xE8); ///< ADC0 Control                                     
SFR (ADC0GTH,  0xC4); ///< ADC0 Greater-Than High Byte                      
SFR (ADC0GTL,  0xC3); ///< ADC0 Greater-Than Low Byte                       
SFR (ADC0H,    0xBE); ///< ADC0 Data Word High Byte                         
SFR (ADC0L,    0xBD); ///< ADC0 Data Word Low Byte                          
SFR (ADC0LTH,  0xC6); ///< ADC0 Less-Than High Byte                         
SFR (ADC0LTL,  0xC5); ///< ADC0 Less-Than Low Byte                          
SFR (ADC0MX,   0x96); ///< ADC0 Multiplexer Selection                       
SFR (ADC0PWR,  0xBB); ///< ADC0 Power Control                               
SFR (ADC0TK,   0xBC); ///< ADC0 Burst Mode Track Time                       
SFR (B,        0xF0); ///< B Register                                       
SFR (CKCON,    0x8E); ///< Clock Control                                    
SFR (CLKSEL,   0xA9); ///< Clock Select                                     
SFR (CPT0CN,   0x9B); ///< Comparator 0 Control                             
SFR (CPT0MD,   0x9D); ///< Comparator 0 Mode                                
SFR (CPT0MX,   0x9F); ///< Comparator 0 Multiplexer Selection               
SFR (CRC0AUTO, 0x9E); ///< CRC0 Automatic Control                           
SFR (CRC0CN,   0x84); ///< CRC0 Control                                     
SFR (CRC0CNT,  0x9A); ///< CRC0 Automatic Flash Sector Count                
SFR (CRC0DAT,  0x86); ///< CRC0 Data Output                                 
SFR (CRC0FLIP, 0x9C); ///< CRC0 Bit Flip                                    
SFR (CRC0IN,   0x85); ///< CRC0 Data Input                                  
SFR (CS0CF,    0xAA); ///< Capacitive Sense 0 Configuration                 
SFR (CS0CN,    0xB0); ///< Capacitive Sense 0 Control                       
SFR (CS0DH,    0xEE); ///< Capacitive Sense 0 Data High Byte                
SFR (CS0DL,    0xED); ///< Capacitive Sense 0 Data Low Byte                 
SFR (CS0MD1,   0xAF); ///< Capacitive Sense 0 Mode 1                        
SFR (CS0MD2,   0xF3); ///< Capacitive Sense 0 Mode 2                        
SFR (CS0MD3,   0xF3); ///< Capacitive Sense 0 Mode 3                        
SFR (CS0MX,    0xAB); ///< Capacitive Sense 0 Mux Channel Select            
SFR (CS0PM,    0xDE); ///< Capacitive Sense 0 Pin Monitor                   
SFR (CS0SCAN0, 0xD2); ///< Capacitive Sense 0 Channel Scan Mask 0           
SFR (CS0SCAN1, 0xD3); ///< Capacitive Sense 0 Channel Scan Mask 1           
SFR (CS0SE,    0xDE); ///< Capacitive Sense 0 Auto Scan End Channel         
SFR (CS0SS,    0xDD); ///< Capacitive Sense 0 Auto Scan Start Channel       
SFR (CS0THH,   0xFE); ///< Capacitive Sense 0 Comparator Threshold High Byte
SFR (CS0THL,   0xFD); ///< Capacitive Sense 0 Comparator Threshold Low Byte 
SFR (DERIVID,  0xE3); ///< Device Identification                            
SFR (DPH,      0x83); ///< Data Pointer High                                
SFR (DPL,      0x82); ///< Data Pointer Low                                 
SFR (EIE1,     0xE6); ///< Extended Interrupt Enable 1                      
SFR (EIE2,     0xE7); ///< Extended Interrupt Enable 2                      
SFR (EIP1,     0xF6); ///< Extended Interrupt Priority 1                    
SFR (EIP2,     0xF7); ///< Extended Interrupt Priority 2                    
SFR (FLKEY,    0xB7); ///< Flash Lock and Key                               
SFR (FLSCL,    0xB6); ///< Flash Scale                                      
SFR (FLWR,     0xE5); ///< Flash Write Only                                 
SFR (IE,       0xA8); ///< Interrupt Enable                                 
SFR (IP,       0xB8); ///< Interrupt Priority                               
SFR (IREF0CF,  0xB9); ///< Current Reference Configuration                  
SFR (IREF0CN,  0xD6); ///< Current Reference Control                        
SFR (IT01CF,   0xE4); ///< INT0/INT1 Configuration                          
SFR (OSCICL,   0xB3); ///< High Frequency Oscillator Calibration            
SFR (OSCICN,   0xB2); ///< High Frequency Oscillator Control                
SFR (OSCXCN,   0xB1); ///< External Oscillator Control                      
SFR (P0,       0x80); ///< Port 0 Pin Latch                                 
SFR (P0DRV,    0x99); ///< Port 0 Drive Strength                            
SFR (P0MASK,   0xC7); ///< Port 0 Mask                                      
SFR (P0MAT,    0xD7); ///< Port 0 Match                                     
SFR (P0MDIN,   0xF1); ///< Port 0 Input Mode                                
SFR (P0MDOUT,  0xA4); ///< Port 0 Output Mode                               
SFR (P0SKIP,   0xD4); ///< Port 0 Skip                                      
SFR (P1,       0x90); ///< Port 1 Pin Latch                                 
SFR (P1DRV,    0x9B); ///< Port 1 Drive Strength                            
SFR (P1MASK,   0xBF); ///< Port 1 Mask                                      
SFR (P1MAT,    0xCF); ///< Port 1 Match                                     
SFR (P1MDIN,   0xF2); ///< Port 1 Input Mode                                
SFR (P1MDOUT,  0xA5); ///< Port 1 Output Mode                               
SFR (P1SKIP,   0xD5); ///< Port 1 Skip                                      
SFR (P2,       0xA0); ///< Port 2 Pin Latch                                 
SFR (P2DRV,    0x9D); ///< Port 2 Drive Strength                            
SFR (P2MDOUT,  0xA6); ///< Port 2 Output Mode                               
SFR (PCA0CN,   0xD8); ///< PCA Control                                      
SFR (PCA0CPH0, 0xFC); ///< PCA Channel 0 Capture Module High Byte           
SFR (PCA0CPH1, 0xEA); ///< PCA Channel 1 Capture Module High Byte           
SFR (PCA0CPH2, 0xEC); ///< PCA Channel 2 Capture Module High Byte           
SFR (PCA0CPL0, 0xFB); ///< PCA Channel 0 Capture Module Low Byte            
SFR (PCA0CPL1, 0xE9); ///< PCA Channel 1 Capture Module Low Byte            
SFR (PCA0CPL2, 0xEB); ///< PCA Channel 2 Capture Module Low Byte            
SFR (PCA0CPM0, 0xDA); ///< PCA Channel 0 Capture/Compare Mode 0             
SFR (PCA0CPM1, 0xDB); ///< PCA Channel 1 Capture/Compare Mode               
SFR (PCA0CPM2, 0xDC); ///< PCA Channel 2 Capture/Compare Mode               
SFR (PCA0H,    0xFA); ///< PCA Counter/Timer High Byte                      
SFR (PCA0L,    0xF9); ///< PCA Counter/Timer Low Byte                       
SFR (PCA0MD,   0xD9); ///< PCA Mode                                         
SFR (PCA0PWM,  0xDF); ///< PCA PWM Configuration                            
SFR (PCON,     0x87); ///< Power Control                                    
SFR (PMU0CF,   0xB5); ///< Power Management Unit Configuration              
SFR (PMU0FL,   0xCE); ///< Power Management Unit Flag                       
SFR (PMU0MD,   0xB5); ///< Power Management Unit Mode                       
SFR (PSCTL,    0x8F); ///< Program Store Control                            
SFR (PSW,      0xD0); ///< Program Status Word                              
SFR (REF0CN,   0xD1); ///< Voltage Reference Control                        
SFR (REG0CN,   0xC9); ///< Voltage Regulator Control                        
SFR (REVID,    0xE2); ///< Revision Identifcation                           
SFR (RSTSRC,   0xEF); ///< Reset Source                                     
SFR (RTC0ADR,  0xAC); ///< RTC Address                                      
SFR (RTC0DAT,  0xAD); ///< RTC Data                                         
SFR (RTC0KEY,  0xAE); ///< RTC Lock and Key                                 
SFR (SBUF0,    0x99); ///< UART0 Serial Port Data Buffer                    
SFR (SCON0,    0x98); ///< UART0 Serial Port Control                        
SFR (SFRPAGE,  0xA7); ///< SFR Page                                         
SFR (SMB0ADM,  0xF5); ///< SMBus 0 Slave Address Mask                       
SFR (SMB0ADR,  0xF4); ///< SMBus 0 Slave Address                            
SFR (SMB0CF,   0xC1); ///< SMBus 0 Configuration                            
SFR (SMB0CN,   0xC0); ///< SMBus 0 Control                                  
SFR (SMB0DAT,  0xC2); ///< SMBus 0 Data                                     
SFR (SP,       0x81); ///< Stack Pointer                                    
SFR (SPI0CFG,  0xA1); ///< SPI0 Configuration                               
SFR (SPI0CKR,  0xA2); ///< SPI0 Clock Rate                                  
SFR (SPI0CN,   0xF8); ///< SPI0 Control                                     
SFR (SPI0DAT,  0xA3); ///< SPI0 Data                                        
SFR (TCON,     0x88); ///< Timer 0/1 Control                                
SFR (TH0,      0x8C); ///< Timer 0 High Byte                                
SFR (TH1,      0x8D); ///< Timer 1 High Byte                                
SFR (TL0,      0x8A); ///< Timer 0 Low Byte                                 
SFR (TL1,      0x8B); ///< Timer 1 Low Byte                                 
SFR (TMOD,     0x89); ///< Timer 0/1 Mode                                   
SFR (TMR2CN,   0xC8); ///< Timer 2 Control                                  
SFR (TMR2H,    0xCD); ///< Timer 2 High Byte                                
SFR (TMR2L,    0xCC); ///< Timer 2 Low Byte                                 
SFR (TMR2RLH,  0xCB); ///< Timer 2 Reload High Byte                         
SFR (TMR2RLL,  0xCA); ///< Timer 2 Reload Low Byte                          
SFR (TMR3CN,   0x91); ///< Timer 3 Control                                  
SFR (TMR3H,    0x95); ///< Timer 3 High Byte                                
SFR (TMR3L,    0x94); ///< Timer 3 Low Byte                                 
SFR (TMR3RLH,  0x93); ///< Timer 3 Reload High Byte                         
SFR (TMR3RLL,  0x92); ///< Timer 3 Reload Low Byte                          
SFR (TOFFH,    0x8E); ///< Temperature Sensor Offset High                   
SFR (TOFFL,    0x8D); ///< Temperature Sensor Offset Low                    
SFR (VDM0CN,   0xFF); ///< VDD Supply Monitor Control                       
SFR (XBR0,     0xE1); ///< Port I/O Crossbar 0                              
SFR (XBR1,     0xE2); ///< Port I/O Crossbar 1                              
SFR (XBR2,     0xE3); ///< Port I/O Crossbar 2                              

//------------------------------------------------------------------------------
// 16-bit Register Definitions (may not work on all compilers)
//------------------------------------------------------------------------------
SFR16 (ADC0GT,  0xC3); ///< ADC0 Greater-Than            
SFR16 (ADC0,    0xBD); ///< ADC0 Data Word               
SFR16 (ADC0LT,  0xC5); ///< ADC0 Less-Than               
SFR16 (DP,      0x82); ///< Data Pointer                 
SFR16 (PCA0CP0, 0xFB); ///< PCA Channel 0 Capture Module 
SFR16 (PCA0CP1, 0xE9); ///< PCA Channel 1 Capture Module 
SFR16 (PCA0CP2, 0xEB); ///< PCA Channel 2 Capture Module 
SFR16 (PCA0,    0xF9); ///< PCA Counter/Timer            
SFR16 (TMR2,    0xCC); ///< Timer 2                      
SFR16 (TMR2RL,  0xCA); ///< Timer 2 Reload               
SFR16 (TMR3,    0x94); ///< Timer 3                      
SFR16 (TMR3RL,  0x92); ///< Timer 3 Reload               

//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------
#define ALARM0   0x08 ///< RTC Alarm Programmed Value 0
#define ALARM1   0x09 ///< RTC Alarm Programmed Value 1
#define ALARM2   0x0A ///< RTC Alarm Programmed Value 2
#define ALARM3   0x0B ///< RTC Alarm Programmed Value 3
#define CAPTURE0 0x00 ///< RTC Timer Capture 0         
#define CAPTURE1 0x01 ///< RTC Timer Capture 1         
#define CAPTURE2 0x02 ///< RTC Timer Capture 2         
#define CAPTURE3 0x03 ///< RTC Timer Capture 3         
#define RTC0CN   0x04 ///< RTC Control                 
#define RTC0XCF  0x06 ///< RTC Oscillator Configuration
#define RTC0XCN  0x05 ///< RTC Oscillator Control      

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN (ADC0 Control)
#define SFR_ADC0CN 0xE8
SBIT (ADC0CN_ADCM0,  SFR_ADC0CN, 0); ///< Start of Conversion Mode Select Bit 0
SBIT (ADC0CN_ADCM1,  SFR_ADC0CN, 1); ///< Start of Conversion Mode Select Bit 1
SBIT (ADC0CN_ADCM2,  SFR_ADC0CN, 2); ///< Start of Conversion Mode Select Bit 2
SBIT (ADC0CN_ADWINT, SFR_ADC0CN, 3); ///< Window Compare Interrupt Flag        
SBIT (ADC0CN_ADBUSY, SFR_ADC0CN, 4); ///< ADC Busy                             
SBIT (ADC0CN_ADINT,  SFR_ADC0CN, 5); ///< Conversion Complete Interrupt Flag   
SBIT (ADC0CN_ADBMEN, SFR_ADC0CN, 6); ///< Burst Mode Enable                    
SBIT (ADC0CN_ADEN,   SFR_ADC0CN, 7); ///< ADC Enable                           

// B (B Register)
#define SFR_B 0xF0
SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

